import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
  state: {
    list: [{
      title: "回忆里的笑容",
      content: "远离家乡的时候，就会想起父母亲慈祥的神情。还在家里的时候，从来没有意识到原来父母亲的笑容是很珍贵的，把父母亲的付出当做理所当然的，也就谈不上珍惜，特别渴望离开父母亲的保护，独自闯荡出属于自己的天地。等真的如愿离开了，面对一个人的孤单，才会怀恋起在父母亲身边生活的温馨时光。父亲虽然严肃，但是看着儿女的眼睛里却充满了期盼和自豪的笑意；母亲永远是那么的温柔而唠叨，嘴角总是挂着期待的笑意。笑容的里温暖是每个游子最想要贴身收藏却又不得不放弃的珍宝，只能凭借着记忆重温那些暖人心脾的点点滴滴，安慰孤独难受的心。",
      date: "2019-3-3"
    }, {
      title: "尘封在沙漏里的友谊",
      content: "曾经你我坚信海誓山盟过后沉淀的必定是坚贞不移、此生不离；曾经你我坚信彼此的心圈在一个核里哪怕时光穿梭也毫无芥蒂；曾经你赠我沙漏与我互定永久告诉我亘古不变天荒地老的情谊。那些曾经在我最灿烂的年华里伴我左右。",
      date: "2019-3-4"
    }]
  },
  mutations: {
    addItem: function (state, value) {
      state.list.push(value)
    }
  },
  actions: {

  }
})
